In [1]:
import pandas as pd
import numpy as np

In [6]:
names=np.array(['Jone','Shawn','Mike','Nick','Sam','Tom','Ricky'])
series=pd.Series(names)

series

In [7]:
series

0     Jone
1    Shawn
2     Mike
3     Nick
4      Sam
5      Tom
6    Ricky
dtype: object

In [9]:
series=pd.Series(name,index=['a','b','c','d','e','f','g'])

In [10]:
series

a     Jone
b    Shawn
c     Mike
d     Nick
e      Sam
f      Tom
g    Ricky
dtype: object

In [11]:
series[0]

'Jone'

In [13]:
series['a']

'Jone'

In [14]:
series.shape

(7,)

In [15]:
series.dtype

dtype('O')

In [16]:
series.head()

a     Jone
b    Shawn
c     Mike
d     Nick
e      Sam
dtype: object

In [17]:
series.head(7)

a     Jone
b    Shawn
c     Mike
d     Nick
e      Sam
f      Tom
g    Ricky
dtype: object

In [19]:
series.head(2)

a     Jone
b    Shawn
dtype: object

In [20]:
series.tail()

c     Mike
d     Nick
e      Sam
f      Tom
g    Ricky
dtype: object

In [21]:
series.tail(2)

f      Tom
g    Ricky
dtype: object

In [22]:
data = {
    "names" : names,
    "dept" : ["IT","IT","HR","Sales","IT","HR","Sales"],
    "salary" : [45000,50000,25000,80000,35000,50000,35000]
}

In [23]:
df=pd.DataFrame(data)

In [24]:
df

   names   dept  salary
0   Jone     IT   45000
1  Shawn     IT   50000
2   Mike     HR   25000
3   Nick  Sales   80000
4    Sam     IT   35000
5    Tom     HR   50000
6  Ricky  Sales   35000

In [25]:
df.columns

Index(['names', 'dept', 'salary'], dtype='object')

In [26]:
df.describe()

             salary
count      7.000000
mean   45714.285714
std    17660.825629
min    25000.000000
25%    35000.000000
50%    45000.000000
75%    50000.000000
max    80000.000000

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
names     7 non-null object
dept      7 non-null object
salary    7 non-null int64
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [28]:
df.head()

   names   dept  salary
0   Jone     IT   45000
1  Shawn     IT   50000
2   Mike     HR   25000
3   Nick  Sales   80000
4    Sam     IT   35000

In [29]:
df['names']

0     Jone
1    Shawn
2     Mike
3     Nick
4      Sam
5      Tom
6    Ricky
Name: names, dtype: object

In [30]:
df['names'][:3]

0     Jone
1    Shawn
2     Mike
Name: names, dtype: object

In [31]:
df['names'][:5]

0     Jone
1    Shawn
2     Mike
3     Nick
4      Sam
Name: names, dtype: object

In [33]:
df['names'][1:5]
#1:5 that is range define

1    Shawn
2     Mike
3     Nick
4      Sam
Name: names, dtype: object

In [37]:
df['names'].head()

0     Jone
1    Shawn
2     Mike
3     Nick
4      Sam
Name: names, dtype: object

In [38]:
df['names'].head(5)

0     Jone
1    Shawn
2     Mike
3     Nick
4      Sam
Name: names, dtype: object

In [40]:
df[['names','dept']]

   names   dept
0   Jone     IT
1  Shawn     IT
2   Mike     HR
3   Nick  Sales
4    Sam     IT
5    Tom     HR
6  Ricky  Sales

In [41]:
df['names'].head()

0     Jone
1    Shawn
2     Mike
3     Nick
4      Sam
Name: names, dtype: object

In [43]:
df[0:3]
# react just like a array

   names dept  salary
0   Jone   IT   45000
1  Shawn   IT   50000
2   Mike   HR   25000

In [44]:
df[0:5]

   names   dept  salary
0   Jone     IT   45000
1  Shawn     IT   50000
2   Mike     HR   25000
3   Nick  Sales   80000
4    Sam     IT   35000

In [45]:
df.loc[0]

names      Jone
dept         IT
salary    45000
Name: 0, dtype: object

In [46]:
df.loc[4]

names       Sam
dept         IT
salary    35000
Name: 4, dtype: object

In [47]:
df.loc[0:3]

   names   dept  salary
0   Jone     IT   45000
1  Shawn     IT   50000
2   Mike     HR   25000
3   Nick  Sales   80000

In [48]:
df_2 = pd.DataFrame(data, index=['a','b','c','d','e','f','g'])

In [49]:
df_2.head()

   names   dept  salary
a   Jone     IT   45000
b  Shawn     IT   50000
c   Mike     HR   25000
d   Nick  Sales   80000
e    Sam     IT   35000

In [50]:
df_2.head(3)

   names dept  salary
a   Jone   IT   45000
b  Shawn   IT   50000
c   Mike   HR   25000

In [52]:
df_2.loc['a']

names      Jone
dept         IT
salary    45000
Name: a, dtype: object

In [53]:
df_2.loc['g']

names     Ricky
dept      Sales
salary    35000
Name: g, dtype: object

In [55]:
df_2.iloc[0]

names      Jone
dept         IT
salary    45000
Name: a, dtype: object

In [56]:
df_2.iloc[4]

names       Sam
dept         IT
salary    35000
Name: e, dtype: object

In [58]:
df_2.iloc[0:3]
#now he react just like array

   names dept  salary
a   Jone   IT   45000
b  Shawn   IT   50000
c   Mike   HR   25000

In [59]:
df_2.loc['b':'g']

   names   dept  salary
b  Shawn     IT   50000
c   Mike     HR   25000
d   Nick  Sales   80000
e    Sam     IT   35000
f    Tom     HR   50000
g  Ricky  Sales   35000

In [60]:
df_2['dept']=='IT'

a     True
b     True
c    False
d    False
e     True
f    False
g    False
Name: dept, dtype: bool

In [62]:
df_2[df_2['dept']=='IT']

   names dept  salary
a   Jone   IT   45000
b  Shawn   IT   50000
e    Sam   IT   35000

In [63]:
df[df['dept']=='IT']

   names dept  salary
0   Jone   IT   45000
1  Shawn   IT   50000
4    Sam   IT   35000

In [64]:
df[df['dept']=='HR']

  names dept  salary
2  Mike   HR   25000
5   Tom   HR   50000

In [66]:
df[df['salary']>=50000]

   names   dept  salary
1  Shawn     IT   50000
3   Nick  Sales   80000
5    Tom     HR   50000

In [69]:
df[(df['salary']>=50000) & (df['dept']=='IT')]

   names dept  salary
1  Shawn   IT   50000

In [71]:
df[(df['salary']>=50000) | (df['dept']=='IT')]

   names   dept  salary
0   Jone     IT   45000
1  Shawn     IT   50000
3   Nick  Sales   80000
4    Sam     IT   35000
5    Tom     HR   50000